const Guide = () => {
  return (
    <>
      <h2>ברוכים הבאים למדריך של ה-Dib It!</h2>
      <p>
        ה-Dib It היא מערכת קוד פתוח לתכנון מערכת באוניברסיטת תל אביב. המערכת
        נועדה להיות יחסית דומה ל-Bid It שהיא כיום המערכת הנפוצה למטרה זו. הכי
        חשוב להגיד - אם יש לכם בקשות/טענות/המלצות כלשהן, נשמח לשמוע מכם{" "}
        <a href="/contact-us" className="link handle text-accent">
          כאן.
        </a>
      </p>
      <h2>הוספת קורסים ותכנון לו"ז</h2>
      <p>
        בצד ימין של המסך (בטלפונים - בתחילת העמוד), בתוך "חיפוש קורסים להוספה",
        אתם יכולים לבחור את הקורסים שאתם רוצים להכניס למערכת שלכם. תוכלו להיעזר
        בהשלמה האוטומטית של החיפוש, ולאחר שתלחצו על קורס הוא יתווסף לתחתית רשימת
        הקורסים שלכם.
      </p>
      <p>
        בתוך כל קורס ברשימה שלכם, אתם יכולים לבחור את הקבוצות אליהן אתם רוצים
        להירשם/להגיע. לאחר שתוסיפו/תסירו קבוצה, היא תופיע מיד בצד השמאלי של המסך
        (בטלפונים - בתחתית העמוד), במידה ואתם מסתכלים על לשונית ה-"מערכת".
      </p>
      <p>
        כמו כן עומדים לרשותכם קישורים שימושיים: לציוני העבר בקורס באתר TAU
        Refactor שממשיך את TAU Factor הנהדר, לסטטיסטיקות בידינג של הקורס באתר
        האוניברסיטה, לתוצאות החיפוש של הקורס במערכת הרשמית של האוניברסיטה וקישור
        למבחני העבר של הקורס.{" "}
        <b>
          מבחני העבר של הקורסים הם קישורים למודל ורלוונטיים רק עבור הפקולטה
          למדעים מדויקים.
        </b>{" "}
        אם יש מאגר בחינות לפקולטות נוספות, נשמח להוסיף אותו לכאן!
      </p>
      <p>
        כדי להסיר קורס אתם יכולים ללחוץ על כפתור האשפה בפינה השמאלית העליונה של
        כרטיס הקורס, ואתם גם יכולים לשנות את הסדר (זה ויזואלי בלבד) באמצעות
        החצים לידו.
      </p>
      <h2>לשונית ה-"מבחנים"</h2>
      <p>
        בלשונית המבחנים תוכלו לראות את תקופת המבחנים בקורסים שבחרתם. הפרשי הימים
        נועדו לעזור לכם לראות אם יש לכם תקופת מבחנים צפופה מדי עבורכם ולסייע לכם
        לתכנן את תקופת המבחנים שלכם. בתצוגת לוח השנה בצד השמאלי של המסך
        (בטלפונים - בתחתית המסך), תוכלו לראות מסומנים באדום ימים בהם יש התנגשות
        בין מבחנים!
      </p>
      <h2>לשונית ה-"תרגול מבחנים"</h2>
      <p>
        בלשונית תרגול המבחנים תוכלו להיעזר בתקופת המבחנים שלכם: תסמנו את המבחנים
        שכבר ביצעתם, תוכלו לראות מי היו המרצים ומה היה הממוצע בכל סמסטר, ואם יש
        להיעזר בקישורים למבחני עבר במודל!
      </p>
      <h2>לשונית ה-"תוכנית"</h2>
      <p>
        בלשונית התוכנית תוכלו לראות את הקורסים בתוכנית הלימודים שלכם, לפי המידע
        מהידיעונים של האוניברסיטה. לאחר שתבחרו את הפקולטה שלכם, ובתוכה את תוכנית
        הלימוד שלכם, תוכלו לראות את כל הקטגוריות בתוכנית הלימוד והקורסים בהן.
      </p>
      <p>
        כמו כן, תוכלו לראות קורסים שלקחתם כבר באיזשהו סמסטר ב-Dib It, ועבור
        קורסים שלא נמצאים במערכת שלכם מה הפרש הימים של המבחן שלהם מהמבחן הכי
        קרוב במערכת שלכם. במידה ואין בקורס מבחן, תוכלו לראות גם את זה
      </p>
      <p>הלשונית נועדה לעזור לכם לבחור קורסים להוסיף למערכת בצורה נוחה!</p>
      <h2>גיבוי ושחזור של המערכות שלכם</h2>
      <p>
        בתוך הפעולות שנמצאות בכפתור עם שלושת הנקודות האנכיות, באמצעות לחיצה על
        כפתור ה-"גיבוי", אתם יכולים להוריד קובץ בפורמט JSON שמכיל את כל המערכות
        שלכם. תוכלו לשמור אותו היכן שרק תרצו, ואף לשלוח לחבריכם, ובאמצעות לחיצה
        על כפתור ה-"שחזור" אפשר יהיה לאחר מכן לשחזר את כל המערכות ששמורות בקובץ!
      </p>
      <p>
        באופן דומה, באמצעות לחיצה על כפתור ה-"גיבוי בגוגל" תוכלו לשמור בשרת את
        המערכות שלכם, וכשתלחצו "שחזור מגוגל" במכשיר הזה או במכשיר אחר שמחובר
        לאותו חשבון תשחזרו את כל המערכות ששמרתם!
      </p>
      <h2>ייצוא ל-Apple/Google Calendar</h2>
      <p>
        בתוך הפעולות שנמצאות בכפתור עם שלושת הנקודות האנכיות, באמצעות לחיצה על
        כפתור ה-"ייצוא ל-Apple/Google Calendar" תוכלו להוריד קובץ בפורמט ICS של
        כל השיעורים במערכת שלכם, ושל כל המבחנים שלכם. לאחר מכן, תוכלו לבצע לקובץ
        זה ייבוא (Import) ב-Apple/Google Calendar שלכם.
      </p>
      <p>
        אם אתם רוצים לייבא את הקובץ ל-Google Calendar, לחצו על ההתראה בכדי
        להיכנס לעמוד הייבוא ישירות.
      </p>
      <p>
        אם אתם משתמשים במכשיר אפל ורוצים לייבא את הקובץ ל-Apple Calendar, פשוט
        תפתחו אותו!
      </p>
      <h2>הדפסה</h2>
      <p>
        כדי להדפיס את המערכת שלכם או את תקופת המבחנים שלכם, בחרו בלשונית המתאימה
        ולחצו על כפתור ה-"הדפסה/שמירה כ-PDF"!
      </p>
      <h2>שמירת מערכות ב-Google</h2>
      <p>
        אם אתם רוצים לשמור את המערכות שלכם בשרת שלנו ב-Firebase (של Google), אתם
        יכולים להתחבר עם חשבון הגוגל שלכם באמצעות לחיצה על הכפתור "התחבר/י"
        בפינה השמאלית העליונה של האתר.
      </p>
      <p>
        אתם מוזמנים לעבור על קוד המקור של ה-Dib It{" "}
        <a
          className="link handle text-accent"
          href="https://github.com/arazimproject/dib-it"
        >
          כאן
        </a>{" "}
        ולראות, בין היתר, בדיוק כיצד הנתונים נשמרים - לפי המזהה הייחודי של
        המשתמש שלכם. שימו לב שהמערכת שלכם לא מוצפנת והיא נמצאת על שרת ה-Firebase
        שלנו.
      </p>
      <p>
        באופן עקרוני משתמשים אחרים במערכת לא אמורים להיות מסוגלים לגשת למערכת
        שלכם (יש Firestore Rules, למתעניינים).
      </p>
      <h2>המלצות בידינג אוטומטיות</h2>
      <p>
        אם תרצו לקבל מספרים התחלתיים שאמורים להיות יחסית סבירים עבור בידינג
        לקבוצות שאתם רוצים להירשם אליהן, בתוך הפעולות תוכלו ללחוץ על כפתור
        ״המלצות בידינג אוטומטיות״!
      </p>
      <p>
        לאחר מכן, הזינו את הנקודות שיש לכם בכל מסלול לימוד. תוכלו לגלות את זה
        באמצעות התחברות למערכת הבידינג - מסלול הלימוד מופיע למעלה תחת הכותרת
        ״חתך״ וכמות הנקודות תחת ״מכ. נקודות״ (ככל הנראה קיצור של ״מכסת״ ולא
        ״מפקדת כיתה״, אך מי יודע?). לכל מסלול לחצו על ״הוספת מסלול בידינג״
        והזינו את הפרטים הללו.
      </p>
      <p>
        לאחר מכן לחצו על הכפתור הצבעוני של ״חישוב המלצות״ ותקבלו המלצות
        ראשוניות!
      </p>
      <p>
        שימו לב, לאחר מכן תופיע לכם טבלה בין ״הוספת מסלול בבידינג״ לבין ״חישוב
        המלצות״. הטבלה מאפשרת לאלגוריתם לדעת באילו מהמסלולים אפשר לשים נקודות
        לקבל את הקורס. <b>סביר שיש טעויות</b>, ואם תתקנו אותן תקבלו תוצאות טובות
        יותר!
      </p>
      <p>
        אם לא ברור לכם תחת אילו תנאים משפטיים ההמלצות ניתנות, מוזמנים לקרוא{" "}
        <a className="link handle text-accent" href="/disclaimer">
          כאן
        </a>
        .
      </p>
    </>
  )
}

export default Guide
